# 1.2 Lists

# 1.3 Strings

# 1.4 Pandas

In [1]:
#1.
import pandas as pd
#Reading and loading the data
data=pd.read_csv("https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv")

In [2]:
#2.a
#we used head() in order to display the first five rows of the Dataframe
data.head(5)

         DATE   OPEN   HIGH    LOW  CLOSE
0  01/02/1990  17.24  17.24  17.24  17.24
1  01/03/1990  18.19  18.19  18.19  18.19
2  01/04/1990  19.22  19.22  19.22  19.22
3  01/05/1990  20.11  20.11  20.11  20.11
4  01/08/1990  20.26  20.26  20.26  20.26

In [3]:
#2.b
#We used .describe() to generate descriptive statistics.
#These descriptive statistics include a summary of the central tendency and dispersion
data.describe()

              OPEN         HIGH          LOW        CLOSE
count  8576.000000  8576.000000  8576.000000  8576.000000
mean     19.667087    20.475051    18.915540    19.581101
std       7.979316     8.440179     7.470016     7.906388
min       9.010000     9.310000     8.560000     9.140000
25%      13.937500    14.540000    13.407500    13.880000
50%      17.795000    18.470000    17.220000    17.760000
75%      23.102500    23.960000    22.322500    22.990000
max      82.690000    89.530000    72.760000    82.690000

In [4]:
#3.a
#we used pd.cut() and 'bins' argument to divide the values of CLOSE variable in 3 intervals:
# [0,20] the first interval:Low; [20,30] the second interval:Medium; [30,100] the third interval: High
#finally with the argument 'labels' we added labels to them.
data["Level"]=pd.cut(data["CLOSE"], bins=[0,20,30,100], labels=["Low", "Medium", "High"])
#checking with the first 10 observations
data.head(10)

         DATE   OPEN   HIGH    LOW  CLOSE   Level
0  01/02/1990  17.24  17.24  17.24  17.24     Low
1  01/03/1990  18.19  18.19  18.19  18.19     Low
2  01/04/1990  19.22  19.22  19.22  19.22     Low
3  01/05/1990  20.11  20.11  20.11  20.11  Medium
4  01/08/1990  20.26  20.26  20.26  20.26  Medium
5  01/09/1990  22.20  22.20  22.20  22.20  Medium
6  01/10/1990  22.44  22.44  22.44  22.44  Medium
7  01/11/1990  20.05  20.05  20.05  20.05  Medium
8  01/12/1990  24.64  24.64  24.64  24.64  Medium
9  01/15/1990  26.34  26.34  26.34  26.34  Medium

In [5]:
#3.b
#We used .to_datetime to convert dates into pandas date format. Then with .dt.year we extract the year
pd.to_datetime(data["DATE"]).dt.year
#Creating a new column
data["Year"]=pd.to_datetime(data["DATE"]).dt.year
#checking with the first 10 observations
data.head(10)

         DATE   OPEN   HIGH    LOW  CLOSE   Level  Year
0  01/02/1990  17.24  17.24  17.24  17.24     Low  1990
1  01/03/1990  18.19  18.19  18.19  18.19     Low  1990
2  01/04/1990  19.22  19.22  19.22  19.22     Low  1990
3  01/05/1990  20.11  20.11  20.11  20.11  Medium  1990
4  01/08/1990  20.26  20.26  20.26  20.26  Medium  1990
5  01/09/1990  22.20  22.20  22.20  22.20  Medium  1990
6  01/10/1990  22.44  22.44  22.44  22.44  Medium  1990
7  01/11/1990  20.05  20.05  20.05  20.05  Medium  1990
8  01/12/1990  24.64  24.64  24.64  24.64  Medium  1990
9  01/15/1990  26.34  26.34  26.34  26.34  Medium  1990

In [6]:
#4.a
#we created a new dataframe
mis_datos= {'DATE':['19/08/2002'], 'OPEN':[20.26], 'HIGH':[17.24], 'LOW':[22.44], 'CLOSE':[24.34], 'Level':['Medium'], 'Year':[2002]}
my_df=pd.DataFrame(mis_datos)
#adding it to the given dataframe
pd.concat([data, my_df])

            DATE   OPEN   HIGH    LOW  CLOSE   Level  Year
0     01/02/1990  17.24  17.24  17.24  17.24     Low  1990
1     01/03/1990  18.19  18.19  18.19  18.19     Low  1990
2     01/04/1990  19.22  19.22  19.22  19.22     Low  1990
3     01/05/1990  20.11  20.11  20.11  20.11  Medium  1990
4     01/08/1990  20.26  20.26  20.26  20.26  Medium  1990
...          ...    ...    ...    ...    ...     ...   ...
8572  12/29/2023  12.55  13.19  12.36  12.45     Low  2023
8573  01/02/2024  13.22  14.23  13.10  13.20     Low  2024
8574  01/03/2024  13.35  14.22  13.33  14.04     Low  2024
8575  01/04/2024  13.93  14.20  13.64  14.13     Low  2024
0     19/08/2002  20.26  17.24  22.44  24.34  Medium  2002

[8577 rows x 7 columns]

In [7]:
#5.a
#we grouped using .groupby()[] 'Year' based on 'CLOSE' and with the .mean() method we obtain the average of each year of the variable 'CLOSE'
data.groupby("Year")['CLOSE'].mean()

Year
1990    23.063478
1991    18.373373
1992    15.452047
1993    12.686245
1994    13.925516
1995    12.388770
1996    16.442165
1997    22.363984
1998    25.602976
1999    24.371912
2000    23.315000
2001    25.749677
2002    27.292460
2003    21.982857
2004    15.479644
2005    12.807063
2006    12.810320
2007    17.535936
2008    32.695534
2009    31.479008
2010    22.548889
2011    24.202579
2012    17.801640
2013    14.230119
2014    14.175992
2015    16.674087
2016    15.825635
2017    11.090239
2018    16.639841
2019    15.387540
2020    29.251304
2021    19.656151
2022    25.637148
2023    16.849027
2024    13.790000
Name: CLOSE, dtype: float64

In [8]:
#5.b
#we used .groupby to group the data based on 'Level' then we used .get_group to get the observations with 'Level'='Low'
#and finally we counted them with len(). The argument 'observed=False' is so that it does not show us all the grouped observations
n_Low=len(data.groupby(['Level'], observed=False).get_group('Low'))
print('Days with Low Level:',n_Low)

#days with Medium level
n_Medium=len(data.groupby(['Level'], observed=False).get_group('Medium'))
print('Days with Medium Level:',n_Medium)

#days with High Level
n_High=len(data.groupby(['Level'], observed=False).get_group('High'))
print('Days with High Level:',n_High)

Days with Low Level: 5274
Days with Medium Level: 2582
Days with High Level: 720